console.time("time");
var dt = {
    "一号线": ["西塱", "坑口", "花地湾", "芳村", "黄沙", "长寿路", "陈家祠", "西门口", "公园前", "农讲所", "烈士陵园", "东山口", "杨箕", "体育西路", "体育中心", "广州东站"],
    "二号线": ["嘉禾望岗", "黄边", "江夏", "萧岗", "白云文化广场", "白云公园", "飞翔公园", "三元里", "广州火车站", "越秀公园", "纪念堂", "公园前", "海珠广场", "市二宫", "江南西", "昌岗", "江泰路", "东晓南", "南洲", "洛溪", "南浦", "会江", "石壁", "广州南站"],
    "三北线": ["体育西路", "林和西", "广州东站", "燕塘", "梅花园", "京溪南方医院", "同和", "永泰", "白云大道北", "嘉禾望岗", "龙归", "人和", "高增", "机场南（1号航站楼）", "机场北（2号航站楼）"],
    "三号线": ["番禺广场", "市桥", "汉溪长隆", "大石", "厦滘", "沥滘", "大塘", "客村", "广州塔", "珠江新城", "体育西路", "石牌桥", "岗顶", "华师", "五山", "天河客运站"],
    "四号线": ["黄村", "车陂", "车陂南", "万胜围", "官洲", "大学城北", "大学城南", "新造", "官桥", "石碁", "海傍", "低涌", "东涌", "庆盛", "黄阁汽车城", "黄阁", "蕉门", "金洲", "飞沙角", "广隆", "大涌", "塘坑", "南横", "南沙客运港"],
    "五号线": ["文冲", "大沙东", "大沙地", "鱼珠", "三溪", "东圃", "车陂南", "科韵路", "员村", "潭村", "猎德", "珠江新城", "五羊邨", "杨箕", "动物园", "区庄", "淘金", "小北", "广州火车站", "西村", "西场", "中山八", "坦尾", "滘口"],
    "八号线": ["滘心", "亭岗", "石井", "小坪", "石潭", "聚龙", "上步", "同德", "鹅掌坦", "陈家祠", "华林寺", "文化公园", "同福西", "凤凰新村", "沙园", "宝岗大道", "昌岗", "晓港", "中大", "鹭江", "客村", "赤岗", "磨碟沙", "新港东", "琶洲", "万胜围"],
    "广佛线": ["沥滘", "南洲", "石溪", "燕岗", "沙园", "沙涌", "鹤洞", "西塱", "菊树", "龙溪", "金融高新区", "千灯湖", "虫雷 岗", "南桂路", "桂城", "朝安", "普君北路", "祖庙", "同济路", "季华园", "魁奇路", "澜石", "世纪莲", "东平", "新城东"],
    "六号线": ["浔峰岗", "横沙", "沙贝", "河沙", "坦尾", "如意坊", "黄沙", "文化公园", "一德路", "海珠广场", "北京路", "团一大广场", "东湖", "东山口", "区庄", "黄花岗", "沙河顶", "沙河", "天平架", "燕塘", "天河客运站", "长湴", "植物园", "龙洞", "柯木塱", "高塘石", "黄陂", "金峰", "暹岗", "苏元", "萝岗", "香雪"],
    "七号线": ["广州南站", "石壁", "谢村", "钟村", "汉溪长隆", "南村万博", "员岗", "板桥", "大学城南"],
    "九号线": ["飞鹅岭", "花都汽车城", "广州北站", "花城路", "花果山公园", "花都广场", "马鞍山公园", "莲塘", "清㘵", "清塘", "高增"],
    "十三号线": ["鱼珠", "裕丰围", "双岗", "南海神庙", "夏园", "南岗", "沙村", "白江", "新塘", "官湖", "新沙"],
    "十四号线(知识城)": ["新和", "红卫", "新南", "枫下", "知识城", "何棠下", "旺村", "汤村", "镇龙北", "镇龙"],
    "二十一号线": ["员村", "天河公园", "棠东", "黄村", "大观南路", "天河智慧城", "神舟路", "科学城", "苏元", "水西", "长平", "金坑", "镇龙西", "镇龙", "中新", "坑贝", "凤岗", "朱村", "山田", "钟岗", "增城广场"],
    "十四号线": ["嘉禾望岗", "白云东平", "夏良", "太和", "竹料", "钟落潭", "马沥", "新和", "太平", "神岗", "赤草", "从化客运站", "东风"]
};
var innerChange = {};
var stations = {};
for (var line in dt) {
    innerChange[line] = [];
    dt[line].forEach(function (station) {
        if (!(station in stations)) {
            stations[station] = [];
        }
        stations[station].forEach(function (otherLine) {
            innerChange[line].push(otherLine);
            innerChange[otherLine].push(line);
        });
        stations[station].push(line);
    });
}
var endLine = '四号线',
    startLine = '十四号线';
var gone = [],
    plan = [],
    dfs = function (nowLine) {
        if (gone.indexOf(nowLine) >= 0) {
            return;
        }
        gone.push(nowLine);
        if (endLine == nowLine) {
            plan.push(gone.map(function (a) {
                return a
            }));

            //console.log(gone);
            gone.pop();
            return;
        }
        //if (gone.length <= 4) {

            innerChange[nowLine].forEach(function (nextLine) {
                dfs(nextLine);
            });


        //}

        gone.pop();


    }
dfs(startLine);
plan.sort(function (a, b) {
    return a.length - b.length
});
console.log(plan);
console.timeEnd("time");
/*
for (var i in stations) {
    if (stations[i].length > 1) {
        for (var a = 0; a < stations[i].length; a++) {
            for (var b = a + 1; b < stations[i].length; b++) {
                innerChange[stations[i][a]].push(stations[i][b]);
                innerChange[stations[i][b]].push(stations[i][a]);
            }
        }

        //console.log(stations[i]);
    }
}*/
//console.log(innerChange)